# parameters
nc: 8 # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
   #    input  [1,3,128,128]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2   1          [64,64,32]
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4     2  [32,32,64]
   [-1, 3, BottleneckCSP, [128]],          #  3    [32,32,64]
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8      4   [16,16,128]
   [-1, 9, BottleneckCSP, [256]],          # 5     [16,16,128]
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16      # 6   [8,8,256]
   [-1, 9, BottleneckCSP, [512]],             # 7    [8,8,256]
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32    8     [4,4,512]
   [-1, 1, SPP, [1024, [5, 9, 13]]],          # 9     [4,4,512]
   [-1, 3, BottleneckCSP, [1024, False]],  # 10     [4,4,512]
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],    # 11   [4,4,256]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #     12    [8,8,256]
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4     13     [8,8,512]
   [-1, 3, BottleneckCSP, [512, False]],  # 14            [8,8,256]

   [-1, 1, Conv, [256, 1, 1]],       # 15          [8,8,128]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 16         [16,16,128]
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3      17       [16,16,256]
   [-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small)           18        [16,16,128]

   [-1, 1, Conv, [256, 3, 2]],          #     19                [8,8,128]
   [[-1, 14], 1, Concat, [1]],  # cat head P4    20              [8,8,256]
   [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)     21    [8,8,256]

   [-1, 1, Conv, [512, 3, 2]],       # 22              [4,4,256]
   [[-1, 10], 1, Concat, [1]],  # cat head P5      23      [4,4,512]
   [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)        24     [4,4,512]

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
